controllers/CouponController.php

    protected function findModel($id)
    {
        if (($model = Coupon::findOne($id)) !== null) {
---
SELECT * FROM `coupon` WHERE `id`='19'