controllers/FacebookController.php

SELECT * FROM `coupon` WHERE `id`='18'
---
	public function actionGo($user_id, $coupon_id){
        $coupon = Coupon::find()->where(['id' => $coupon_id])->one();