controllers/UsersController.php

    protected function findModel($id)
    {
        if (($model = Users::findOne($id)) !== null) {
---
SELECT * FROM `users` WHERE `id`='7'