models/db/Coupon.php

    public static function getByShopId($shop_id){
        $find = Coupon::find()
            ->where(['shop_id' =>$shop_id])
            ->asArray()
            ->all();
---
SELECT * FROM `coupon` WHERE `shop_id`=6

    public function getParentName(){
        $name = (new \yii\db\Query())
            ->select(['title'])
            ->from('shop')
            ->where(['id' => $this->shop_id])
            ->one();
---
SELECT `title` FROM `shop` WHERE `id`=1