models/db/Shop.php

SELECT * FROM `wrong_input` WHERE `second_name`='телемарт'
SELECT * FROM `shop` WHERE `title`='телемарт'
---
    public static function searchShop($string){
        $wrong = WrongInput::find()->where(['second_name' => mb_strtolower($string)])->one();
        if($wrong){
            $find = Shop::find()->where(['id' => $wrong->shop_id])->one();
        }else{
            $find = Shop::find()->where(['title' => mb_strtolower($string)])->one();