models/db/WrongInput.php

    public function getParentName(){
        $name = (new \yii\db\Query())
            ->select(['title'])
            ->from('shop')
            ->where(['id' => $this->shop_id])
            ->one();
---
SELECT `title` FROM `shop` WHERE `id`=3