models/Now.php

SELECT * FROM `users` WHERE `user_id`='2953614638082813'
---
	public function getParams(){
        $find_user    = Users::find()->where(['user_id' => $this->user_id])->one();

SELECT * FROM `users` WHERE `user_id`='2953614638082813'
UPDATE `users` SET `params`='{\n    \"admin\": 0\n}' WHERE `id`=8
---
	public function saveParams(){
	    $find    = Users::find()->where(['user_id' => $this->user_id])->one();
	    $find->params = json_encode($this->params, JSON_UNESCAPED_UNICODE+JSON_PRETTY_PRINT);
	    return ($find->save()) ? true : false;