models/Users.php

SELECT EXISTS(SELECT * FROM `users` WHERE `users`.`user_id`='2953614638082813')
INSERT INTO `users` (`user_id`) VALUES ('2953614638082813')
---
    public static function createUser($user_id){
        if($user = Users::findUser($user_id)){
            //$user->last_time = date("Y-m-d H:i:s");
            $user->save();
            return true;
        }else{
            $new = new Users();
            $new->user_id = $user_id;
            if($new->save()){

SELECT * FROM `users` WHERE `user_id`='2953614638082813'
---
    public static function findUser($user_id){
        $find = Users::find()->where(['user_id' => $user_id])->one();